---
kind: type
id: T:Autodesk.Revit.DB.LayerModifier
source: html/ae7bade6-00b8-698f-d2a4-541905b668e9.htm
---
# Autodesk.Revit.DB.LayerModifier

A modifier used to designate extra strings to appear in the exported layer name.

## Syntax (C#)
```csharp
public class LayerModifier : IDisposable
```

## Remarks
A modifier consists of a type (from ModifierType and an optional separator.
 Apply a modifier to one or more ExportLayerInfo objects to modify the layer name that
 will be assigned when a Revit object is exported.